## **HOW DO I HANDLE MISSING VALUES IN PANDAS.?**

In [ ]:
import pandas as pd

df = pd.read_csv('http://bit.ly/uforeports');

In [8]:
df.tail()

              City Colors Reported Shape Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

### **Count no.of nulls/NaNs**

In [15]:
df.isnull().tail()

        City  Colors Reported  Shape Reported  State   Time
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

In [18]:
df.isnull().sum() #by default axis=0 in sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [24]:
df.isnull().sum(axis='columns').sum()  # Or 1

18028

In [26]:
df.isnull().sum().sum() == df.isnull().sum(axis='columns').sum()

True

In [30]:
df[df.City.isnull()].head()

    City Colors Reported Shape Reported State             Time
21   NaN             NaN            NaN    LA   8/15/1943 0:00
22   NaN             NaN          LIGHT    LA   8/15/1943 0:00
204  NaN             NaN           DISK    CA  7/15/1952 12:30
241  NaN            BLUE           DISK    MT   7/4/1953 14:00
613  NaN             NaN           DISK    NV   7/1/1960 12:00

### **Drop missing values**

In [36]:
df.dropna(axis=1, how = 'all').shape

# how = 'any' default
#how = 'all' for any row or column with all the entries are NaN

# axis = 0 default for rows
# axis = 1 default for columns

(18241, 5)

###### **Drop rows / coumns with NaNs present in only specific columns**

In [40]:
df.dropna(subset=['City','Colors Reported'], how='all').shape

(18221, 5)

### **Count elements in columns & Fill NaNs**

In [45]:
df['Colors Reported'].value_counts(dropna=False) ## be default dropna=True

NaN                       15359
RED                         780
GREEN                       531
ORANGE                      528
BLUE                        450
YELLOW                      169
RED GREEN                    89
RED BLUE                     78
RED ORANGE                   44
GREEN BLUE                   34
RED GREEN BLUE               33
ORANGE YELLOW                26
RED YELLOW                   25
ORANGE GREEN                 23
YELLOW GREEN                 17
ORANGE BLUE                  10
RED YELLOW GREEN              9
YELLOW BLUE                   6
ORANGE GREEN BLUE             5
YELLOW GREEN BLUE             5
RED YELLOW GREEN BLUE         4
RED ORANGE YELLOW             4
RED ORANGE BLUE               3
RED ORANGE GREEN              3
RED YELLOW BLUE               3
ORANGE YELLOW GREEN           1
ORANGE YELLOW BLUE            1
RED ORANGE YELLOW BLUE        1
Name: Colors Reported, dtype: int64

In [47]:
df['Colors Reported'].fillna(value='BLUE', inplace=True)

In [49]:
df['Colors Reported'].value_counts(dropna=False)

BLUE                      15809
RED                         780
GREEN                       531
ORANGE                      528
YELLOW                      169
RED GREEN                    89
RED BLUE                     78
RED ORANGE                   44
GREEN BLUE                   34
RED GREEN BLUE               33
ORANGE YELLOW                26
RED YELLOW                   25
ORANGE GREEN                 23
YELLOW GREEN                 17
ORANGE BLUE                  10
RED YELLOW GREEN              9
YELLOW BLUE                   6
ORANGE GREEN BLUE             5
YELLOW GREEN BLUE             5
RED ORANGE YELLOW             4
RED YELLOW GREEN BLUE         4
RED ORANGE BLUE               3
RED ORANGE GREEN              3
RED YELLOW BLUE               3
RED ORANGE YELLOW BLUE        1
ORANGE YELLOW GREEN           1
ORANGE YELLOW BLUE            1
Name: Colors Reported, dtype: int64

In [50]:
###